package com.fhs.core.validation;

public interface Pattern
{
    /**
     * 验证两位小数的正则 1、除了个位，十位以上不能以0开头 2、小数部分可有可元 3、小数点后可以一位或者二位
     */
    String twoDecimal = "^([1-9]\\d*|0)(\\.\\d{1,2})?$";
    
    /**
     * 手机号验证
     */
    String PHONENUM =
        "^(((13[0-9]{1})|(15[0-9]{1})|(18[0-9]{1})|(17[0-9]{1})|(16[0-9]{1})|(19[0-9]{1})|(14[0-9]{1}))+\\d{8})$";
    
    /**
     * 邮箱验证
     */
    String EMAIL = "[a-zA-Z_]{1,}[0-9]{0,}@(([a-zA-z0-9]-*){1,}\\.){1,3}[a-zA-z\\-]{1,}";
    
    /**
     * 正整数（适用金额）
     */
    String POSITIVY = "^[1-9]\\d*$";
    
    
    
}
